app/views/users/show.html.erb

<ul>
<% @user.documents.each do |doc|%>
---
SELECT "documents".* FROM "documents" INNER JOIN "document_accesses" ON "documents"."id" = "document_accesses"."document_id" WHERE "document_accesses"."user_id" = ?  [["user_id", 1]]

<%end%>
<% Document.all.each do |doc|%>
---
SELECT "documents".* FROM "documents"