app/views/friendships/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <% if friendship.user_id != current_user.id %>
        <% user_name = "#{friendship.user.first_name} #{friendship.user.last_name}" %>