app/views/documents/show.html.erb


<p>You have <%= current_user.documents.count%> documents</p>
---
SELECT COUNT(*) FROM "documents" INNER JOIN "document_accesses" ON "documents"."id" = "document_accesses"."document_id" WHERE "document_accesses"."user_id" = ?  [["user_id", 11]]