app/controllers/documents_controller.rb

    def index
        @documents = Document.all
---
SELECT "documents".* FROM "documents"

    def show
        @document = Document.find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]

    def create
        @document = Document.create(data: params[:data])
        DocumentAccess.create(user_id:current_user.id, document_id:@document.id)
---
INSERT INTO "documents" ("data", "created_at", "updated_at") VALUES (?, ?, ?)  [["data", "<p>Hello</p><p>amda<strong>mkimadoqmow</strong></p>"], ["created_at", "2020-01-22 10:10:45.218106"], ["updated_at", "2020-01-22 10:10:45.218106"]]
INSERT INTO "document_accesses" ("user_id", "document_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 11], ["document_id", 30], ["created_at", "2020-01-22 16:11:37.561662"], ["updated_at", "2020-01-22 16:11:37.561662"]]

    def edit
        @document = Document.find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]

    def update
        @document = Document.find(params[:id])
        @document.update(data: params[:document][:data])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
UPDATE "documents" SET "data" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["data", "<p>kkkk</p>"], ["updated_at", "2020-01-22 16:15:34.821175"], ["id", 30]]