app/controllers/friendships_controller.rb

    def index
        @friendships = Friendship.all.where("user_id = ? OR friend_user_id = ?", current_user.id, current_user.id)
        @friendships = @friendships.select{|f| f.confirmed?}
---
SELECT "friendships".* FROM "friendships" WHERE (user_id = 1 OR friend_user_id = 1)
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def show
        @friendship = Friendship.find(params[:id])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]