app/controllers/messages_controller.rb

    def new
        @message = Message.all.where(id: params[:format]).first
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? ORDER BY "messages"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]