app/controllers/messages_controller.rb

    def edit
        @message = Message.all.where(id: params[:id]).first
        if @message.data.first.keys.first != current_user
---
SELECT "messages".* FROM "messages" LIMIT ?  [["LIMIT", 11]]