app/controllers/messages_controller.rb

    def show
        @messages = Message.all.where(friendship_id: params[:id])
        if @messages.count == 0; @messages = nil; end
        @friend = Friendship.all.where(id: params[:id]).first
---
SELECT "messages".* FROM "messages" WHERE "messages"."friendship_id" = ? ORDER BY "messages"."id" ASC LIMIT ?  [["friendship_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."friendship_id" = ?  [["friendship_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."friendship_id" = ? LIMIT ?  [["friendship_id", 1], ["LIMIT", 11]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? ORDER BY "friendships"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def new
        @friend = User.all.where(id: params[:format]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def create
        @message = Message.new
        @friend = User.all.where(id: params[:format]).first
        friendship_id = Friendship.all.where("user_id = ? AND friend_user_id = ? OR user_id = ? AND friend_user_id = ?", current_user.id, @friend.id, @friend.id, current_user.id).first.id
        @message.friendship_id = friendship_id
        @message.data = []
        @message.data.push({current_user => params[:data]})
        @message.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE (user_id = 1 AND friend_user_id = 9 OR user_id = 9 AND friend_user_id = 1) ORDER BY "friendships"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "messages" ("data", "friendship_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    def edit
        @message = Message.all.where(id: params[:id]).first
        friendship = Friendship.all.where(id: @message.friendship_id).first
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? ORDER BY "messages"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? ORDER BY "friendships"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @message = Message.all.where(id: params[:id]).first
        @message.data.push({current_user => params[:data]})
        @message.save
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? ORDER BY "messages"."id" ASC LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "messages" SET "data" = ?, "updated_at" = ? WHERE "messages"."id" = ?