app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
     user = User.new(user_params)
      if user.valid?
        user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Apples"], ["password_digest", "$2a$12$DtqWjy/Y4BKGX9vBDfEFx.3a8Vur2YDKM8qp.3v2.UjcnUNQwiuG6"], ["updated_at", "2020-01-22 18:19:51.070874"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        # byebug
        user.first_name = user_params[:first_name]
        user.last_name = user_params[:last_name]
        user.username = user_params[:username]
        user.password = user_params[:password]
        if user.valid?
          user.save